Revit 2022 API
AnalyticalModel.IsEnabled Method
 Reports whether the Analytical Model is enabled or disabled.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool IsEnabled()
Visual Basic
Public Function IsEnabled As Boolean
Visual C++
public:
bool IsEnabled()
Return Value
 True if Analytical Model is enabled, false otherwise.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace